#ifndef TMPro_TMP_Text_DEFINED
#define TMPro_TMP_Text_DEFINED
// This .hpp file was compiled via beatsaber-hook/shared/helper.py's Parse Mode.
// Created by Sc2ad.
// Methods may not be valid!
#include <dlfcn.h>
#include <string_view>
#include "../utils/typedefs.h"
#include "../utils/il2cpp-functions.hpp"
#include "../utils/il2cpp-utils.hpp"
// Contains MethodInfo/Il2CppClass data for: TMPro.TMP_Text
namespace TMPro_TMP_Text {
    // TMPro.TMP_Text
    typedef struct Class : Il2CppObject {
        Il2CppString* m_text; // 0xB0
        uint8_t m_isRightToLeft; // 0xB8
        void* m_fontAsset; // 0xC0
        void* m_currentFontAsset; // 0xC8
        uint8_t m_isSDFShader; // 0xD0
        void* m_sharedMaterial; // 0xD8
        void* m_currentMaterial; // 0xE0
        void* m_materialReferences; // 0xE8
        void* m_materialReferenceIndexLookup; // 0xF0
        void* m_materialReferenceStack; // 0xF8
        int m_currentMaterialIndex; // 0x140
        void* m_fontSharedMaterials; // 0x148
        void* m_fontMaterial; // 0x150
        void* m_fontMaterials; // 0x158
        uint8_t m_isMaterialDirty; // 0x160
        void* m_fontColor32; // 0x164
        void* m_fontColor; // 0x168
        static void* s_colorWhite; // 0x0
        void* m_underlineColor; // 0x178
        void* m_strikethroughColor; // 0x17C
        void* m_highlightColor; // 0x180
        void* m_highlightPadding; // 0x184
        uint8_t m_enableVertexGradient; // 0x194
        void* m_colorMode; // 0x198
        void* m_fontColorGradient; // 0x19C
        void* m_fontColorGradientPreset; // 0x1E0
        void* m_spriteAsset; // 0x1E8
        uint8_t m_tintAllSprites; // 0x1F0
        uint8_t m_tintSprite; // 0x1F1
        void* m_spriteColor; // 0x1F4
        uint8_t m_overrideHtmlColors; // 0x1F8
        void* m_faceColor; // 0x1FC
        void* m_outlineColor; // 0x200
        float m_outlineWidth; // 0x204
        float m_fontSize; // 0x208
        float m_currentFontSize; // 0x20C
        float m_fontSizeBase; // 0x210
        void* m_sizeStack; // 0x218
        void* m_fontWeight; // 0x230
        void* m_FontWeightInternal; // 0x234
        void* m_FontWeightStack; // 0x238
        uint8_t m_enableAutoSizing; // 0x250
        float m_maxFontSize; // 0x254
        float m_minFontSize; // 0x258
        float m_fontSizeMin; // 0x25C
        float m_fontSizeMax; // 0x260
        void* m_fontStyle; // 0x264
        void* m_FontStyleInternal; // 0x268
        void* m_fontStyleStack; // 0x26C
        uint8_t m_isUsingBold; // 0x276
        void* m_textAlignment; // 0x278
        void* m_lineJustification; // 0x27C
        void* m_lineJustificationStack; // 0x280
        void* m_textContainerLocalCorners; // 0x298
        float m_characterSpacing; // 0x2A0
        float m_cSpacing; // 0x2A4
        float m_monoSpacing; // 0x2A8
        float m_wordSpacing; // 0x2AC
        float m_lineSpacing; // 0x2B0
        float m_lineSpacingDelta; // 0x2B4
        float m_lineHeight; // 0x2B8
        float m_lineSpacingMax; // 0x2BC
        float m_paragraphSpacing; // 0x2C0
        float m_charWidthMaxAdj; // 0x2C4
        float m_charWidthAdjDelta; // 0x2C8
        uint8_t m_enableWordWrapping; // 0x2CC
        uint8_t m_isCharacterWrappingEnabled; // 0x2CD
        uint8_t m_isNonBreakingSpace; // 0x2CE
        uint8_t m_isIgnoringAlignment; // 0x2CF
        float m_wordWrappingRatios; // 0x2D0
        void* m_overflowMode; // 0x2D4
        int m_firstOverflowCharacterIndex; // 0x2D8
        void* m_linkedTextComponent; // 0x2E0
        uint8_t m_isLinkedTextComponent; // 0x2E8
        uint8_t m_isTextTruncated; // 0x2E9
        uint8_t m_enableKerning; // 0x2EA
        uint8_t m_enableExtraPadding; // 0x2EB
        uint8_t checkPaddingRequired; // 0x2EC
        uint8_t m_isRichText; // 0x2ED
        uint8_t m_parseCtrlCharacters; // 0x2EE
        uint8_t m_isOverlay; // 0x2EF
        uint8_t m_isOrthographic; // 0x2F0
        uint8_t m_isCullingEnabled; // 0x2F1
        uint8_t m_ignoreRectMaskCulling; // 0x2F2
        uint8_t m_ignoreCulling; // 0x2F3
        void* m_horizontalMapping; // 0x2F4
        void* m_verticalMapping; // 0x2F8
        float m_uvLineOffset; // 0x2FC
        void* m_renderMode; // 0x300
        void* m_geometrySortingOrder; // 0x304
        uint8_t m_VertexBufferAutoSizeReduction; // 0x308
        int m_firstVisibleCharacter; // 0x30C
        int m_maxVisibleCharacters; // 0x310
        int m_maxVisibleWords; // 0x314
        int m_maxVisibleLines; // 0x318
        uint8_t m_useMaxVisibleDescender; // 0x31C
        int m_pageToDisplay; // 0x320
        uint8_t m_isNewPage; // 0x324
        void* m_margin; // 0x328
        float m_marginLeft; // 0x338
        float m_marginRight; // 0x33C
        float m_marginWidth; // 0x340
        float m_marginHeight; // 0x344
        float m_width; // 0x348
        void* m_textInfo; // 0x350
        uint8_t m_havePropertiesChanged; // 0x358
        uint8_t m_isUsingLegacyAnimationComponent; // 0x359
        void* m_transform; // 0x360
        void* m_rectTransform; // 0x368
        uint8_t autoSizeTextContainer_k__BackingField; // 0x370
        uint8_t m_autoSizeTextContainer; // 0x371
        void* m_mesh; // 0x378
        uint8_t m_isVolumetricText; // 0x380
        void* m_spriteAnimator; // 0x388
        float m_flexibleHeight; // 0x390
        float m_flexibleWidth; // 0x394
        float m_minWidth; // 0x398
        float m_minHeight; // 0x39C
        float m_maxWidth; // 0x3A0
        float m_maxHeight; // 0x3A4
        void* m_LayoutElement; // 0x3A8
        float m_preferredWidth; // 0x3B0
        float m_renderedWidth; // 0x3B4
        uint8_t m_isPreferredWidthDirty; // 0x3B8
        float m_preferredHeight; // 0x3BC
        float m_renderedHeight; // 0x3C0
        uint8_t m_isPreferredHeightDirty; // 0x3C4
        uint8_t m_isCalculatingPreferredValues; // 0x3C5
        int m_recursiveCount; // 0x3C8
        int m_layoutPriority; // 0x3CC
        uint8_t m_isCalculateSizeRequired; // 0x3D0
        uint8_t m_isLayoutDirty; // 0x3D1
        uint8_t m_verticesAlreadyDirty; // 0x3D2
        uint8_t m_layoutAlreadyDirty; // 0x3D3
        uint8_t m_isAwake; // 0x3D4
        uint8_t m_isWaitingOnResourceLoad; // 0x3D5
        uint8_t m_isInputParsingRequired; // 0x3D6
        void* m_inputSource; // 0x3D8
        Il2CppString* old_text; // 0x3E0
        float m_fontScale; // 0x3E8
        float m_fontScaleMultiplier; // 0x3EC
        void* m_htmlTag; // 0x3F0
        void* m_xmlAttribute; // 0x3F8
        void* m_attributeParameterValues; // 0x400
        float tag_LineIndent; // 0x408
        float tag_Indent; // 0x40C
        void* m_indentStack; // 0x410
        uint8_t tag_NoParsing; // 0x428
        uint8_t m_isParsingText; // 0x429
        void* m_FXMatrix; // 0x42C
        uint8_t m_isFXMatrixSet; // 0x46C
        void* m_TextParsingBuffer; // 0x470
        void* m_internalCharacterInfo; // 0x478
        void* m_input_CharArray; // 0x480
        int m_charArray_Length; // 0x488
        int m_totalCharacterCount; // 0x48C
        void* m_SavedWordWrapState; // 0x490
        void* m_SavedLineState; // 0x720
        int m_characterCount; // 0x9B0
        int m_firstCharacterOfLine; // 0x9B4
        int m_firstVisibleCharacterOfLine; // 0x9B8
        int m_lastCharacterOfLine; // 0x9BC
        int m_lastVisibleCharacterOfLine; // 0x9C0
        int m_lineNumber; // 0x9C4
        int m_lineVisibleCharacterCount; // 0x9C8
        int m_pageNumber; // 0x9CC
        float m_maxAscender; // 0x9D0
        float m_maxCapHeight; // 0x9D4
        float m_maxDescender; // 0x9D8
        float m_maxLineAscender; // 0x9DC
        float m_maxLineDescender; // 0x9E0
        float m_startOfLineAscender; // 0x9E4
        float m_lineOffset; // 0x9E8
        void* m_meshExtents; // 0x9EC
        void* m_htmlColor; // 0x9FC
        void* m_colorStack; // 0xA00
        void* m_underlineColorStack; // 0xA18
        void* m_strikethroughColorStack; // 0xA30
        void* m_highlightColorStack; // 0xA48
        void* m_colorGradientPreset; // 0xA60
        void* m_colorGradientStack; // 0xA68
        float m_tabSpacing; // 0xA80
        float m_spacing; // 0xA84
        void* m_styleStack; // 0xA88
        void* m_actionStack; // 0xAA0
        float m_padding; // 0xAB8
        float m_baselineOffset; // 0xABC
        void* m_baselineOffsetStack; // 0xAC0
        float m_xAdvance; // 0xAD8
        void* m_textElementType; // 0xADC
        void* m_cached_TextElement; // 0xAE0
        void* m_cached_Underline_Character; // 0xAE8
        void* m_cached_Ellipsis_Character; // 0xAF0
        void* m_defaultSpriteAsset; // 0xAF8
        void* m_currentSpriteAsset; // 0xB00
        int m_spriteCount; // 0xB08
        int m_spriteIndex; // 0xB0C
        int m_spriteAnimationID; // 0xB10
        uint8_t m_ignoreActiveState; // 0xB14
        void* k_Power; // 0xB18
        static void* k_LargePositiveVector2; // 0x4
        static void* k_LargeNegativeVector2; // 0xC
        static float k_LargePositiveFloat; // 0x14
        static float k_LargeNegativeFloat; // 0x18
        static int k_LargePositiveInt; // 0x1C
        static int k_LargeNegativeInt; // 0x20
    } Class;
    static bool __cached = false;
    static Il2CppClass* klass;
    static const MethodInfo* get_text;
    static const MethodInfo* set_text;
    static const MethodInfo* get_isRightToLeftText;
    static const MethodInfo* set_isRightToLeftText;
    static const MethodInfo* get_font;
    static const MethodInfo* set_font;
    static const MethodInfo* get_fontSharedMaterial;
    static const MethodInfo* set_fontSharedMaterial;
    static const MethodInfo* get_fontSharedMaterials;
    static const MethodInfo* set_fontSharedMaterials;
    static const MethodInfo* get_fontMaterial;
    static const MethodInfo* set_fontMaterial;
    static const MethodInfo* get_fontMaterials;
    static const MethodInfo* set_fontMaterials;
    static const MethodInfo* get_color;
    static const MethodInfo* set_color;
    static const MethodInfo* get_alpha;
    static const MethodInfo* set_alpha;
